In [423]:
import pandas as pd

#load data
data = pd.read_csv('C:/Users/RAJ/Desktop/PY/real-estate-predictor/data/bengaluru_house_prices.csv') 
data.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [425]:
data = data.drop(['area_type', 'availability','society'], axis=1) #delete collumns

In [427]:
data.isnull().sum() #check null values

location        1
size           16
total_sqft      0
bath           73
balcony       609
price           0
dtype: int64

In [429]:
data = data.dropna(subset=['location','size'])#delete null values from specific columns

In [431]:
data = data.reset_index(drop=True)# reset index number

In [433]:
data =data.rename(columns={'size' : 'bhk'}) # renamed column size

In [435]:
data.head()#check column

                   location        bhk total_sqft  bath  balcony   price
0  Electronic City Phase II      2 BHK       1056   2.0      1.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0      3.0  120.00
2               Uttarahalli      3 BHK       1440   2.0      3.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0      1.0   95.00
4                  Kothanur      2 BHK       1200   2.0      1.0   51.00

In [437]:
data['bhk'] = data['bhk'].str.split() #split the bhk columns value

In [439]:
data.head()# check column

                   location           bhk total_sqft  bath  balcony   price
0  Electronic City Phase II      [2, BHK]       1056   2.0      1.0   39.07
1          Chikka Tirupathi  [4, Bedroom]       2600   5.0      3.0  120.00
2               Uttarahalli      [3, BHK]       1440   2.0      3.0   62.00
3        Lingadheeranahalli      [3, BHK]       1521   3.0      1.0   95.00
4                  Kothanur      [2, BHK]       1200   2.0      1.0   51.00

In [441]:
for i in range(len(data['bhk'])):
    data['bhk'] = data['bhk'][i][0]  #removed string value

In [442]:
data.head()#check removal

                   location bhk total_sqft  bath  balcony   price
0  Electronic City Phase II   2       1056   2.0      1.0   39.07
1          Chikka Tirupathi   2       2600   5.0      3.0  120.00
2               Uttarahalli   2       1440   2.0      3.0   62.00
3        Lingadheeranahalli   2       1521   3.0      1.0   95.00
4                  Kothanur   2       1200   2.0      1.0   51.00

In [443]:
data['bhk'] = data['bhk'].astype(int) #convert type str to int

In [447]:
data.info()#chek data types

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13303 entries, 0 to 13302
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    13303 non-null  object
 1   bhk         13303 non-null  int32
 2   total_sqft  13303 non-null  object
 3   bath        13246 non-null  float64
 4   balcony     12710 non-null  float64
 5   price       13303 non-null  float64
dtypes: float64(3), int32(1), object(2)
memory usage: 571.7+ KB

In [449]:
data.head()#check data

                   location  bhk total_sqft  bath  balcony   price
0  Electronic City Phase II    2       1056   2.0      1.0   39.07
1          Chikka Tirupathi    2       2600   5.0      3.0  120.00
2               Uttarahalli    2       1440   2.0      3.0   62.00
3        Lingadheeranahalli    2       1521   3.0      1.0   95.00
4                  Kothanur    2       1200   2.0      1.0   51.00

In [451]:
data['location'] = data['location'].str.strip()#remove spaces from start and end in location column

In [453]:
loc_group = data.groupby('location')['location'].agg('count').sort_values(ascending=False)#group the value and arrange in descending order

In [455]:
rare_location = loc_group[loc_group <= 10]#save the rare location

In [457]:
data['location'] = data['location'].apply(lambda x: 'other' if x in rare_location else x) #replace rare locations to other

In [459]:
len(data['location'].unique())

242

In [461]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13303 entries, 0 to 13302
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    13303 non-null  object
 1   bhk         13303 non-null  int32
 2   total_sqft  13303 non-null  object
 3   bath        13246 non-null  float64
 4   balcony     12710 non-null  float64
 5   price       13303 non-null  float64
dtypes: float64(3), int32(1), object(2)
memory usage: 571.7+ KB

In [475]:
data['total_sqft'].str.strip().str.endswith('. Meter').sum()

17

abc

In [413]:
data['total_sqft'] = data['total_sqft'].str.strip()

In [415]:
data['total_sqft'] = data['total_sqft'].str.split()

In [417]:
data['total_sqft'][2085]

['1250', '-', '1305']

In [419]:
for i in range (len(data['total_sqft'])):
    if '-' in data['total_sqft'][i]:
        range_sum = int((float(data['total_sqft'][i][0]) + float(data['total_sqft'][i][-1]))/2)
        data.loc[i,'total_sqft'] = range_sum

In [421]:
data.head()

                   location  bhk total_sqft  bath  balcony   price
0  Electronic City Phase II    2     [1056]   2.0      1.0   39.07
1          Chikka Tirupathi    2     [2600]   5.0      3.0  120.00
2               Uttarahalli    2     [1440]   2.0      3.0   62.00
3        Lingadheeranahalli    2     [1521]   3.0      1.0   95.00
4                  Kothanur    2     [1200]   2.0      1.0   51.00